{
  "basics": {
    "name": "Steve Perkins",
    "label": "",
    "picture": "",
    "email": "steve@steveperkins.com",
    "phone": "404-997-3018",
    "degree": "",
    "website": "www.steveperkins.com",
    "summary": "Over 15 years of experience with enterprise application integration and web development, in environments ranging from startups to the Fortune 500.  Recent experience with microservice architecture, supporting tens of millions of users and over 100 terabytes of data.",
    "highlights": [
      "Lengthy leadership experience, up to managing multiple development teams simultaneously.  I have a background in teaching training classes, and deeply enjoy mentoring junior developers.",

      "Excellent oral and written communication skills.  I've been active in Toastmasters International (a public speaking organization), and interact well with clients and business stakeholders.",

      "Am a published author.  I maintain a technical blog at StevePerkins.com with ~10,000 unique visitors per month, and am also a guest blogger for JavaCodeGeeks.com.  My GitHub account (\"steve-perkins\") hosts a number of open source personal projects and code samples."
    ],
    "location": {
      "address": "4301 Gravitt Place",
      "postalCode": "",
      "city": "Duluth",
      "countryCode": "",
      "region": "GA"
    },
    "profiles": [
      {
        "network": "GitHub / GitLab",
        "username": "steve-perkins",
        "url": "https://github.com/steve-perkins"
      },
      {
        "network": "LinkedIn",
        "username": "perkinssteve",
        "url": "https://www.linkedin.com/in/perkinssteve/"
      }
    ]
  },
  "workLabel": "Recent Experience",
  "work": [
    {
      "company": "BetterCloud",
      "position": "Software Architect",
      "website": "",
      "startDate": "2013-10-01",
      "endDate": "",
      "summary": "BetterCloud is SaaS product company offering analytics, security, and advanced administration for users of Google Apps or Microsoft Office 365.  The total data set within our domain is over 100 terabytes , growing at rate of multiple terabytes per month.",
      "highlights": [
        "We use a microservice architecture, with Google services written in Java and hosted on Google Cloud Platform, and Microsoft services written in C# and deployed to Azure.  Service integration primarily involves AMQP (i.e. RabbitMQ) and REST.  We are in the process of shifting to Docker - based containerization of microservice components across the board.",

        "Responsible for design and ongoing code reviews for one to two development teams of roughly 5 members each.  Individual mentoring is emphasized, along with periodically giving group presentations at our weekly lunch-n-learn sessions.",

        "Beyond ongoing design and code reviews, architects are charged with short-term “spike projects”, to prototype new features or implement major system re-writes.  My particular areas of specialty have been batch processing, messaging middleware, and Big Data.",

        "I introduced BigQuery (i.e. Google’s answer to Hive or Pig running over Hadoop or Spark) into our stack for offline reporting and data analytics.",

        "Drove research and proof-of-concept projects exploring self-hosted alternatives to the Google Cloud Datastore.  We eventually landed on the Apache Cassandra distributed database, in use on the Microsoft side today.",

        "In two major concurrency-related initiatives, I re-wrote our sequential batch processing framework with multithreaded Java, and reimplemented our Java-based proxy microservice using Golang.  Throughput and costs were reduced by an order of magnitude in both cases."
      ]
    },
    {
      "company": "Purchasing Power",
      "position": "Senior Software Developer",
      "website": "",
      "startDate": "2011-04-01",
      "endDate": "2013-10-01",
      "summary": "Technical lead for a retail web platform, combining aspects of e-commerce and employee benefits (i.e. customers pay for large-ticket items through automatic payroll deduction).",
      "highlights": [
        "The legacy commerce architecture was based on Spring web applications, interacting with a business services tier via SOAP (Apache CXF). The main database was Oracle, with some MySQL in the mix as well, making heavy use of PL/SQL and related features.",

        "The company later chose to migrate the commerce architecture to Hybris, a Spring-based product offered by SAP. I was selected as the first developer to be embedded with the consulting firm bootstrapping the migration. I was responsible for driving business and technical requirements, and mentoring other internal developers as they incrementally moved over from legacy development.",

        "Integrated the new Hybris platform with in-house and third-party services (e.g. sales tax calculation, salary verification) using RabbitMQ and Spring AMQP.",

        "Made heavy use of jQuery, and lighter use of AngularJS, in the front-end UI.",

        "Outside of the commerce platform, I designed a system based on Spring Batch for standardizing most of the company’s batch processing needs. For some special batch processes that need to be multithreaded, I used Scala and its Akka-based actor pattern.",

        "Expected to mentor less experienced developers. Initiated a monthly “lunch-n-learn” series, where I presented on various topics and eventually coaxed more introverted developers toward presenting on topics themselves."
      ]
    }
  ],
  "additionalWorkLabel": "Prior Experience",
  "additionalWork": [
    {
      "company": "Ericsson",
      "position": "Senior Java Developer",
      "website": "",
      "startDate": "2010-09-01",
      "endDate": "2011-04-11",
      "summary": "Placeholder summary for Ericsson job",
      "highlights": [
        "Member of small team integrating a video-on-demand platform with a larger portal suite for content carriers. Primary areas of business logic included catalog management for video assets, tracking rentals and equipment provisioning, and limited exposure to DRM encryption.",

        "Architecture was based on EJB business components with JPA entities, running on GlassFish application servers and Oracle databases.",

        "First of two main initiatives was to convert catalog management from a sequential operation to be multithreaded, with work spread out in parallel.  Second initiative involved shifting the functionality to be exposed through RESTful services with JAX-RS, rather than EJB remote interfaces and JAX-WS."
      ]
    },
    {
      "company": "CNN",
      "position": "Software Developer",
      "website": "",
      "startDate": "2009-08-01",
      "endDate": "2010-09-01",
      "summary": "Placeholder summary for CNN job",
      "highlights": [
        "Handled back-end systems integration between internal applications, as well as between CNN and outside partners. Limited front-end development as well using AJAX and JSON.",

        "Primary projects included transitioning to new data providers for all CNN weather forecast and stock quote content, and designing and building a RESTful service to lookup candidate and race information for the 2010 mid-term elections.",

        "Public-facing content was primarily Java-based, using Spring with Hibernate. Internal applications were primarily developed in Perl. Both realms involved heavy transformation of XML data via XSLT.",

        "Expected to be largely self-directed, and take initiative in requirements-gathering and issue resolution with the newsroom producers and other business stakeholders."
      ]
    },
    {
      "company": "Internap",
      "position": "Software Developer",
      "website": "",
      "startDate": "2008-11-01",
      "endDate": "2009-05-01",
      "summary": "Placeholder summary for Internap job",
      "highlights": [
        "Developed and extended billing and operational systems for a publicly-traded Internet solutions company, under an agile/scrum based methodology.  The architecture consisted of Struts-based Java and legacy Perl applications, running on a blend of JBoss servers with Oracle databases.",

        "Primary project was integrating operational data from a recently-acquired competitor into the company's Oracle BRM billing system.",

        "Helped to mentor team members in acquiring the Perl skills to maintain existing legacy code, and spearheaded efforts to migrate some Perl-based operations to the more Java-friendly Groovy scripting language."
      ]
    },
    {
      "company": "TRX",
      "position": "Software Developer",
      "website": "",
      "startDate": "2007-08-01",
      "endDate": "2008-11-01",
      "summary": "Placeholder summary for TRX job",
      "highlights": [
        "Developed data aggregation and mining solutions for financial clients, for the purpose of identifying useful information about consumer spending patterns.",

        "Independently developed a Java-based task management system, adopted by management for resource allocation and project tracking.",

        "Developed a web-based admin system for the business rules engine, utilizing Struts with a Hibernate data access layer and Dojo-based AJAX presentation layer.",

        "Taught internal “lunch-and-learn” classes on areas of Java and Perl development."
      ]
    },
    {
      "company": "Number Six Software",
      "position": "Senior Consultant",
      "website": "",
      "startDate": "2002-06-01",
      "endDate": "2007-08-01",
      "summary": "Placeholder summary for Number Six Software job",
      "highlights": [
        "Primarily I was on-site for over 5 years with the Manheim division of Cox Enterprises.  Helped design and build the first release of OnlineVehicleExchange.com, an dealer-to-dealer automotive auction system. The platform was based on WebSphere Commerce, with data storage in DB2.",

        "Had lead responsibility for the multi-threaded messaging subsystem (JMS), connecting the Linux and Java-based application server to legacy IBM midrange inventory servers. Also responsible for areas of the presentation layer, and helped develop the log4j-based logging subsystem.",

        "Before rolling off onto my next project, I wrote a prototype as the company evaluated migrating away from WebSphere Commerce. The approach used replaced WebSphere Commerce, EJB 2.0, and WebSphere with Spring, Hibernate, and clustered Tomcat.",

        "For the last two years on the client site, I was a team lead in the company’s security and identity management initiative. This project incorporated Tivoli Identity Manager and Tivoli Access Manager to unify the company’s multiple user registries, and provide single-signon (SSO) authentication for internal applications.",

        "In addition to client delivery for Cox Enterprises, I also periodically taught training courses for the consulting firm's corporate education division. Classes taught included IBM WebSphere Administration, XML/XSL Development, and a six-month evening class on Java Programming."
      ]
    },
    {
      "company": "Palarco Consulting",
      "position": "Senior Consultant",
      "website": "",
      "startDate": "2001-07-01",
      "endDate": "2002-06-02",
      "summary": "Placeholder summary for Palarco Consulting job",
      "highlights": [
        "Worked on a series of short-term subcontract engagements for American Bank Note Company, Georgia Farm Bureau, and Mohawk Carpet.  The role of our firm in the larger projects was specialized in integrating IBM legacy midrange servers with WebSphere Commerce applications.",

        "Internally, I taught training classes to our RPG developers who were migrating to Java development."
      ]
    },
    {
      "company": "Context Integration",
      "position": "Consultant",
      "website": "",
      "startDate": "2000-01-01",
      "endDate": "2001-07-01",
      "summary": "Placeholder summary for Context Integration job",
      "highlights": [
        "Worked on an overall team of over two-dozen developers on an 18-month engagement with Georgia Pacific, constructing a B2B commerce application. The web front-end was built using BroadVision One-to-One Commerce with an Oracle database, integrated with 11 billing and inventory systems (AS/400’s and HP-9000’s) nationwide via C++ and CORBA, and IBM MQSeries.",

        "Was the youngest consultant in the company to be promoted to Senior Consultant level, and served as the team lead for this integration system in the final phase of iterative development.",

        "At the conclusion of this project, I wrote a white paper about a design pattern I developed which was recognized by the CTO of BroadVision and included in their company technical knowledgebase."
      ]
    }
  ],
  "education": [
    {
      "institution": "Georgia State University",
      "area": "J.D.",
      "studyType": "",
      "startDate": "",
      "endDate": "2010-06-01",
      "gpa": "",
      "courses": [
        ""
      ]
    },
    {
      "institution": "Georgia Southwestern State University",
      "area": "B.S. Computer Science",
      "studyType": "",
      "startDate": "",
      "endDate": "1999-12-01",
      "gpa": "",
      "courses": [
        ""
      ]
    }
  ],
  "publicationsLabel": "Publications (author)",
  "publications": [
    {
      "name": "Hibernate Search by Example",
      "publisher": "Packt Publishing",
      "releaseDate": "",
      "website": "",
      "summary": "A Java developer’s guide to using Hibernate with Apache Lucene and Solr components, to add custom full-text search functionality in their applications.",
      "ISBN": "184951920X"
    },
    {
      "name": "In the Aftermath of Bilski v. Kappos",
      "publisher": "Practicing Law Institute, 2010 PLI Handbook Series",
      "releaseDate": "",
      "website": "",
      "summary": "An overview of the current state of business method and software patents, presented at the 2010 Practicing Law Institute's Patent Litigation Seminar.",
      "ISBN": ""
    },
    {
      "name": "In the Aftermath of In re Bilski",
      "publisher": "Practicing Law Institute, 2009 PLI Handbook Series",
      "releaseDate": "",
      "website": "",
      "summary": "An overview of method and software patents while the Bilski appeal was pending. Presented at the 2009 Practicing Law Institute's Patent Litigation Seminar.",
      "ISBN": ""
    }
  ],
  "additionalPublicationsLabel": "Additional Publications (technical reviewer)",
  "additionalPublications": [
    {
      "name": "Scala for Java Developers",
      "publisher": "Packt Publishing",
      "releaseDate": "",
      "website": "",
      "summary": "by Thomas Alexandre",
      "ISBN": "1783283637"
    },
    {
      "name": "PostgreSQL Administration Essentials",
      "publisher": "Packt Publishing",
      "releaseDate": "",
      "website": "",
      "summary": "by Hans-Jürgen Schönig",
      "ISBN": "1783988983"
    },
    {
      "name": "Building Web Applications in Spring Web MVC",
      "publisher": "Packt Publishing",
      "releaseDate": "",
      "website": "",
      "summary": "by Koushik Kothagal",
      "ISBN": "9781783286539"
    },
    {
      "name": "Angular UI Development",
      "publisher": "Packt Publishing",
      "releaseDate": "",
      "website": "",
      "summary": "by Matthias Nehlsen and Amit Gharat",
      "ISBN": "9781783288472"
    },
    {
      "name": "Angular Testing Cookbook",
      "publisher": "Packt Publishing",
      "releaseDate": "",
      "website": "",
      "summary": "by Simon Bailey",
      "ISBN": "1783983744"
    }
  ],
  "skills": [
    {
      "name": "Languages",
      "keywords": ["Java", "Go", "Scala", "C#", "JavaScript", "TypeScript"]
    },
    {
      "name": "Frameworks / Libraries",
      "keywords": ["Spring", "JEE", "JPA/Hibernate", "JAX-RS/Jersey", "ASP.NET", "jQuery", "AngularJS 1.x/2.x"]
    },
    {
      "name": "Data",
      "keywords": ["Oracle", "DB2", "MySQL/Percona", "PostgreSQL", "MongoDB", "Cassandra", "Redis", "Elasticsearch", "Apache Spark"]
    },
    {
      "name": "Middleware",
      "keywords": ["RabbitMQ", "Kafka", "Apache Camel"]
    },
    {
      "name": "Environment / Infrastructure",
      "keywords": ["Continuous Integration (Jenkins)", "Docker", "Mesos/Marathon", "Google Cloud Platform", "Microsoft Azure", "Amazon Web Services"]
    }
  ]
}